; domain
(define (domain depot)
(:requirements :strips :typing)
(:types
    place locatable - object
    depot distributor - place
    truck hoist surface - locatable
    pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))
	
(:action drive
  :parameters (?x - truck ?y - place ?z - place) 
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob3351) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate5)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear crate4)
	(at pallet3 distributor0)
	(clear crate12)
	(at pallet4 distributor1)
	(clear crate11)
	(at pallet5 distributor2)
	(clear crate7)
	(at pallet6 depot0)
	(clear crate10)
	(at pallet7 depot1)
	(clear pallet7)
	(at pallet8 distributor2)
	(clear crate9)
	(at pallet9 depot0)
	(clear crate6)
	(at truck0 distributor0)
	(at truck1 depot1)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at crate0 distributor0)
	(on crate0 pallet3)
	(at crate1 distributor2)
	(on crate1 pallet8)
	(at crate2 distributor2)
	(on crate2 crate1)
	(at crate3 depot0)
	(on crate3 pallet9)
	(at crate4 depot2)
	(on crate4 pallet2)
	(at crate5 depot0)
	(on crate5 pallet0)
	(at crate6 depot0)
	(on crate6 crate3)
	(at crate7 distributor2)
	(on crate7 pallet5)
	(at crate8 distributor0)
	(on crate8 crate0)
	(at crate9 distributor2)
	(on crate9 crate2)
	(at crate10 depot0)
	(on crate10 pallet6)
	(at crate11 distributor1)
	(on crate11 pallet4)
	(at crate12 distributor0)
	(on crate12 crate8)
)

(:goal (and
		(on crate0 pallet4)
		(on crate1 pallet1)
		(on crate3 pallet8)
		(on crate4 pallet6)
		(on crate5 crate6)
		(on crate6 pallet0)
		(on crate7 pallet3)
		(on crate8 pallet2)
		(on crate9 crate11)
		(on crate10 crate8)
		(on crate11 crate3)
		(on crate12 crate1)
	)
))

; plan
1. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   goals met: 0 of 12
2. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   goals met: 0 of 12
3. (lift hoist0 crate10 pallet6 depot0)
   deleted: (at crate10 depot0) (clear crate10) (available hoist0) (on crate10 pallet6)
   added: (lifting hoist0 crate10) (clear pallet6)
   goals met: 0 of 12
4. (lift hoist3 crate12 crate8 distributor0)
   deleted: (at crate12 distributor0) (clear crate12) (available hoist3) (on crate12 crate8)
   added: (lifting hoist3 crate12) (clear crate8)
   goals met: 0 of 12
5. (lift hoist2 crate4 pallet2 depot2)
   deleted: (at crate4 depot2) (clear crate4) (available hoist2) (on crate4 pallet2)
   added: (lifting hoist2 crate4) (clear pallet2)
   goals met: 0 of 12
6. (load hoist2 crate4 truck0 depot2)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck0) (available hoist2)
   goals met: 0 of 12
7. (load hoist0 crate10 truck1 depot0)
   deleted: (lifting hoist0 crate10)
   added: (in crate10 truck1) (available hoist0)
   goals met: 0 of 12
8. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 0 of 12
9. (load hoist3 crate12 truck1 distributor0)
   deleted: (lifting hoist3 crate12)
   added: (in crate12 truck1) (available hoist3)
   goals met: 0 of 12
10. (unload hoist3 crate10 truck1 distributor0)
   deleted: (in crate10 truck1) (available hoist3)
   added: (lifting hoist3 crate10)
   goals met: 0 of 12
11. (lift hoist0 crate5 pallet0 depot0)
   deleted: (at crate5 depot0) (clear crate5) (available hoist0) (on crate5 pallet0)
   added: (lifting hoist0 crate5) (clear pallet0)
   goals met: 0 of 12
12. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 0 of 12
13. (drive truck0 depot2 depot0)
   deleted: (at truck0 depot2)
   added: (at truck0 depot0)
   goals met: 0 of 12
14. (drop hoist0 crate5 crate6 depot0)
   deleted: (lifting hoist0 crate5) (clear crate6)
   added: (available hoist0) (at crate5 depot0) (clear crate5) (on crate5 crate6)
   goals met: 1 of 12
15. (unload hoist0 crate4 truck0 depot0)
   deleted: (in crate4 truck0) (available hoist0)
   added: (lifting hoist0 crate4)
   goals met: 1 of 12
16. (drop hoist0 crate4 pallet6 depot0)
   deleted: (lifting hoist0 crate4) (clear pallet6)
   added: (available hoist0) (at crate4 depot0) (clear crate4) (on crate4 pallet6)
   goals met: 2 of 12
17. (drive truck1 depot0 depot2)
   deleted: (at truck1 depot0)
   added: (at truck1 depot2)
   goals met: 2 of 12
18. (lift hoist0 crate5 crate6 depot0)
   deleted: (at crate5 depot0) (clear crate5) (available hoist0) (on crate5 crate6)
   added: (lifting hoist0 crate5) (clear crate6)
   goals met: 1 of 12
19. (drive truck1 depot2 distributor2)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor2)
   goals met: 1 of 12
20. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   goals met: 1 of 12
21. (lift hoist5 crate9 crate2 distributor2)
   deleted: (at crate9 distributor2) (clear crate9) (available hoist5) (on crate9 crate2)
   added: (lifting hoist5 crate9) (clear crate2)
   goals met: 1 of 12
22. (load hoist5 crate9 truck1 distributor2)
   deleted: (lifting hoist5 crate9)
   added: (in crate9 truck1) (available hoist5)
   goals met: 1 of 12
23. (drive truck1 distributor2 depot0)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot0)
   goals met: 1 of 12
24. (lift hoist5 crate7 pallet5 distributor2)
   deleted: (at crate7 distributor2) (clear crate7) (available hoist5) (on crate7 pallet5)
   added: (lifting hoist5 crate7) (clear pallet5)
   goals met: 1 of 12
25. (load hoist5 crate7 truck0 distributor2)
   deleted: (lifting hoist5 crate7)
   added: (in crate7 truck0) (available hoist5)
   goals met: 1 of 12
26. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 1 of 12
27. (lift hoist4 crate11 pallet4 distributor1)
   deleted: (at crate11 distributor1) (clear crate11) (available hoist4) (on crate11 pallet4)
   added: (lifting hoist4 crate11) (clear pallet4)
   goals met: 1 of 12
28. (load hoist4 crate11 truck1 distributor1)
   deleted: (lifting hoist4 crate11)
   added: (in crate11 truck1) (available hoist4)
   goals met: 1 of 12
29. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   goals met: 1 of 12
30. (drive truck1 distributor1 distributor2)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor2)
   goals met: 1 of 12
31. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 1 of 12
32. (drop hoist0 crate5 crate6 depot0)
   deleted: (lifting hoist0 crate5) (clear crate6)
   added: (available hoist0) (at crate5 depot0) (clear crate5) (on crate5 crate6)
   goals met: 2 of 12
33. (drive truck1 distributor2 depot0)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot0)
   goals met: 2 of 12
34. (unload hoist0 crate11 truck1 depot0)
   deleted: (in crate11 truck1) (available hoist0)
   added: (lifting hoist0 crate11)
   goals met: 2 of 12
35. (drop hoist0 crate11 crate5 depot0)
   deleted: (lifting hoist0 crate11) (clear crate5)
   added: (available hoist0) (at crate11 depot0) (clear crate11) (on crate11 crate5)
   goals met: 2 of 12
36. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   goals met: 2 of 12
37. (unload hoist0 crate9 truck1 depot0)
   deleted: (in crate9 truck1) (available hoist0)
   added: (lifting hoist0 crate9)
   goals met: 2 of 12
38. (drop hoist0 crate9 crate4 depot0)
   deleted: (lifting hoist0 crate9) (clear crate4)
   added: (available hoist0) (at crate9 depot0) (clear crate9) (on crate9 crate4)
   goals met: 2 of 12
39. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   goals met: 2 of 12
40. (lift hoist0 crate11 crate5 depot0)
   deleted: (at crate11 depot0) (clear crate11) (available hoist0) (on crate11 crate5)
   added: (lifting hoist0 crate11) (clear crate5)
   goals met: 2 of 12
41. (drop hoist0 crate11 crate9 depot0)
   deleted: (lifting hoist0 crate11) (clear crate9)
   added: (available hoist0) (at crate11 depot0) (clear crate11) (on crate11 crate9)
   goals met: 2 of 12
42. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   goals met: 2 of 12
43. (lift hoist0 crate5 crate6 depot0)
   deleted: (at crate5 depot0) (clear crate5) (available hoist0) (on crate5 crate6)
   added: (lifting hoist0 crate5) (clear crate6)
   goals met: 1 of 12
44. (load hoist0 crate5 truck1 depot0)
   deleted: (lifting hoist0 crate5)
   added: (in crate5 truck1) (available hoist0)
   goals met: 1 of 12
45. (lift hoist0 crate6 crate3 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist0) (on crate6 crate3)
   added: (lifting hoist0 crate6) (clear crate3)
   goals met: 1 of 12
46. (drop hoist0 crate6 pallet0 depot0)
   deleted: (lifting hoist0 crate6) (clear pallet0)
   added: (available hoist0) (at crate6 depot0) (clear crate6) (on crate6 pallet0)
   goals met: 2 of 12
47. (unload hoist0 crate5 truck1 depot0)
   deleted: (in crate5 truck1) (available hoist0)
   added: (lifting hoist0 crate5)
   goals met: 2 of 12
48. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   goals met: 2 of 12
49. (drop hoist0 crate5 crate6 depot0)
   deleted: (lifting hoist0 crate5) (clear crate6)
   added: (available hoist0) (at crate5 depot0) (clear crate5) (on crate5 crate6)
   goals met: 3 of 12
50. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   goals met: 3 of 12
51. (lift hoist0 crate3 pallet9 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 pallet9)
   added: (lifting hoist0 crate3) (clear pallet9)
   goals met: 3 of 12
52. (load hoist0 crate3 truck1 depot0)
   deleted: (lifting hoist0 crate3)
   added: (in crate3 truck1) (available hoist0)
   goals met: 3 of 12
53. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 3 of 12
54. (drive truck1 distributor1 distributor2)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor2)
   goals met: 3 of 12
55. (unload hoist5 crate3 truck1 distributor2)
   deleted: (in crate3 truck1) (available hoist5)
   added: (lifting hoist5 crate3)
   goals met: 3 of 12
56. (drive truck1 distributor2 distributor1)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor1)
   goals met: 3 of 12
57. (drive truck0 depot2 distributor2)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor2)
   goals met: 3 of 12
58. (load hoist5 crate3 truck0 distributor2)
   deleted: (lifting hoist5 crate3)
   added: (in crate3 truck0) (available hoist5)
   goals met: 3 of 12
59. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   goals met: 3 of 12
60. (unload hoist0 crate3 truck0 depot0)
   deleted: (in crate3 truck0) (available hoist0)
   added: (lifting hoist0 crate3)
   goals met: 3 of 12
61. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   goals met: 3 of 12
62. (drop hoist0 crate3 crate5 depot0)
   deleted: (lifting hoist0 crate3) (clear crate5)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 crate5)
   goals met: 3 of 12
63. (lift hoist0 crate11 crate9 depot0)
   deleted: (at crate11 depot0) (clear crate11) (available hoist0) (on crate11 crate9)
   added: (lifting hoist0 crate11) (clear crate9)
   goals met: 3 of 12
64. (drop hoist0 crate11 crate3 depot0)
   deleted: (lifting hoist0 crate11) (clear crate3)
   added: (available hoist0) (at crate11 depot0) (clear crate11) (on crate11 crate3)
   goals met: 4 of 12
65. (lift hoist0 crate9 crate4 depot0)
   deleted: (at crate9 depot0) (clear crate9) (available hoist0) (on crate9 crate4)
   added: (lifting hoist0 crate9) (clear crate4)
   goals met: 4 of 12
66. (drop hoist0 crate9 crate11 depot0)
   deleted: (lifting hoist0 crate9) (clear crate11)
   added: (available hoist0) (at crate9 depot0) (clear crate9) (on crate9 crate11)
   goals met: 5 of 12
67. (lift hoist5 crate2 crate1 distributor2)
   deleted: (at crate2 distributor2) (clear crate2) (available hoist5) (on crate2 crate1)
   added: (lifting hoist5 crate2) (clear crate1)
   goals met: 5 of 12
68. (load hoist5 crate2 truck0 distributor2)
   deleted: (lifting hoist5 crate2)
   added: (in crate2 truck0) (available hoist5)
   goals met: 5 of 12
69. (lift hoist5 crate1 pallet8 distributor2)
   deleted: (at crate1 distributor2) (clear crate1) (available hoist5) (on crate1 pallet8)
   added: (lifting hoist5 crate1) (clear pallet8)
   goals met: 5 of 12
70. (load hoist5 crate1 truck0 distributor2)
   deleted: (lifting hoist5 crate1)
   added: (in crate1 truck0) (available hoist5)
   goals met: 5 of 12
71. (drive truck0 distributor2 depot1)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot1)
   goals met: 5 of 12
72. (unload hoist1 crate1 truck0 depot1)
   deleted: (in crate1 truck0) (available hoist1)
   added: (lifting hoist1 crate1)
   goals met: 5 of 12
73. (drop hoist1 crate1 pallet1 depot1)
   deleted: (lifting hoist1 crate1) (clear pallet1)
   added: (available hoist1) (at crate1 depot1) (clear crate1) (on crate1 pallet1)
   goals met: 6 of 12
74. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 6 of 12
75. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 6 of 12
76. (drive truck1 depot0 depot1)
   deleted: (at truck1 depot0)
   added: (at truck1 depot1)
   goals met: 6 of 12
77. (unload hoist1 crate12 truck1 depot1)
   deleted: (in crate12 truck1) (available hoist1)
   added: (lifting hoist1 crate12)
   goals met: 6 of 12
78. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   goals met: 6 of 12
79. (drop hoist1 crate12 crate1 depot1)
   deleted: (lifting hoist1 crate12) (clear crate1)
   added: (available hoist1) (at crate12 depot1) (clear crate12) (on crate12 crate1)
   goals met: 7 of 12
80. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   goals met: 7 of 12
81. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 7 of 12
82. (lift hoist0 crate9 crate11 depot0)
   deleted: (at crate9 depot0) (clear crate9) (available hoist0) (on crate9 crate11)
   added: (lifting hoist0 crate9) (clear crate11)
   goals met: 6 of 12
83. (drop hoist0 crate9 crate4 depot0)
   deleted: (lifting hoist0 crate9) (clear crate4)
   added: (available hoist0) (at crate9 depot0) (clear crate9) (on crate9 crate4)
   goals met: 6 of 12
84. (lift hoist0 crate11 crate3 depot0)
   deleted: (at crate11 depot0) (clear crate11) (available hoist0) (on crate11 crate3)
   added: (lifting hoist0 crate11) (clear crate3)
   goals met: 5 of 12
85. (drop hoist0 crate11 crate9 depot0)
   deleted: (lifting hoist0 crate11) (clear crate9)
   added: (available hoist0) (at crate11 depot0) (clear crate11) (on crate11 crate9)
   goals met: 5 of 12
86. (lift hoist0 crate3 crate5 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 crate5)
   added: (lifting hoist0 crate3) (clear crate5)
   goals met: 5 of 12
87. (drive truck0 depot2 depot0)
   deleted: (at truck0 depot2)
   added: (at truck0 depot0)
   goals met: 5 of 12
88. (load hoist0 crate3 truck0 depot0)
   deleted: (lifting hoist0 crate3)
   added: (in crate3 truck0) (available hoist0)
   goals met: 5 of 12
89. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   goals met: 5 of 12
90. (unload hoist5 crate3 truck0 distributor2)
   deleted: (in crate3 truck0) (available hoist5)
   added: (lifting hoist5 crate3)
   goals met: 5 of 12
91. (drop hoist5 crate3 pallet8 distributor2)
   deleted: (lifting hoist5 crate3) (clear pallet8)
   added: (available hoist5) (at crate3 distributor2) (clear crate3) (on crate3 pallet8)
   goals met: 6 of 12
92. (drive truck0 distributor2 distributor0)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor0)
   goals met: 6 of 12
93. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 6 of 12
94. (lift hoist0 crate11 crate9 depot0)
   deleted: (at crate11 depot0) (clear crate11) (available hoist0) (on crate11 crate9)
   added: (lifting hoist0 crate11) (clear crate9)
   goals met: 6 of 12
95. (load hoist0 crate11 truck1 depot0)
   deleted: (lifting hoist0 crate11)
   added: (in crate11 truck1) (available hoist0)
   goals met: 6 of 12
96. (drive truck1 depot0 distributor2)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor2)
   goals met: 6 of 12
97. (unload hoist5 crate11 truck1 distributor2)
   deleted: (in crate11 truck1) (available hoist5)
   added: (lifting hoist5 crate11)
   goals met: 6 of 12
98. (drop hoist5 crate11 crate3 distributor2)
   deleted: (lifting hoist5 crate11) (clear crate3)
   added: (available hoist5) (at crate11 distributor2) (clear crate11) (on crate11 crate3)
   goals met: 7 of 12
99. (lift hoist0 crate9 crate4 depot0)
   deleted: (at crate9 depot0) (clear crate9) (available hoist0) (on crate9 crate4)
   added: (lifting hoist0 crate9) (clear crate4)
   goals met: 7 of 12
100. (drive truck1 distributor2 depot0)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot0)
   goals met: 7 of 12
101. (load hoist0 crate9 truck1 depot0)
   deleted: (lifting hoist0 crate9)
   added: (in crate9 truck1) (available hoist0)
   goals met: 7 of 12
102. (drive truck1 depot0 distributor2)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor2)
   goals met: 7 of 12
103. (unload hoist5 crate9 truck1 distributor2)
   deleted: (in crate9 truck1) (available hoist5)
   added: (lifting hoist5 crate9)
   goals met: 7 of 12
104. (drop hoist5 crate9 crate11 distributor2)
   deleted: (lifting hoist5 crate9) (clear crate11)
   added: (available hoist5) (at crate9 distributor2) (clear crate9) (on crate9 crate11)
   goals met: 8 of 12
105. (load hoist3 crate10 truck0 distributor0)
   deleted: (lifting hoist3 crate10)
   added: (in crate10 truck0) (available hoist3)
   goals met: 8 of 12
106. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   goals met: 8 of 12
107. (drive truck1 distributor2 distributor1)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor1)
   goals met: 8 of 12
108. (lift hoist3 crate8 crate0 distributor0)
   deleted: (at crate8 distributor0) (clear crate8) (available hoist3) (on crate8 crate0)
   added: (lifting hoist3 crate8) (clear crate0)
   goals met: 8 of 12
109. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 8 of 12
110. (load hoist3 crate8 truck1 distributor0)
   deleted: (lifting hoist3 crate8)
   added: (in crate8 truck1) (available hoist3)
   goals met: 8 of 12
111. (drive truck1 distributor0 depot2)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot2)
   goals met: 8 of 12
112. (unload hoist2 crate8 truck1 depot2)
   deleted: (in crate8 truck1) (available hoist2)
   added: (lifting hoist2 crate8)
   goals met: 8 of 12
113. (drive truck1 depot2 distributor0)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor0)
   goals met: 8 of 12
114. (drop hoist2 crate8 pallet2 depot2)
   deleted: (lifting hoist2 crate8) (clear pallet2)
   added: (available hoist2) (at crate8 depot2) (clear crate8) (on crate8 pallet2)
   goals met: 9 of 12
115. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 9 of 12
116. (lift hoist3 crate0 pallet3 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist3) (on crate0 pallet3)
   added: (lifting hoist3 crate0) (clear pallet3)
   goals met: 9 of 12
117. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   goals met: 9 of 12
118. (load hoist3 crate0 truck0 distributor0)
   deleted: (lifting hoist3 crate0)
   added: (in crate0 truck0) (available hoist3)
   goals met: 9 of 12
119. (unload hoist3 crate7 truck0 distributor0)
   deleted: (in crate7 truck0) (available hoist3)
   added: (lifting hoist3 crate7)
   goals met: 9 of 12
120. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   goals met: 9 of 12
121. (unload hoist2 crate10 truck0 depot2)
   deleted: (in crate10 truck0) (available hoist2)
   added: (lifting hoist2 crate10)
   goals met: 9 of 12
122. (drive truck0 depot2 distributor1)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor1)
   goals met: 9 of 12
123. (unload hoist4 crate0 truck0 distributor1)
   deleted: (in crate0 truck0) (available hoist4)
   added: (lifting hoist4 crate0)
   goals met: 9 of 12
124. (drop hoist3 crate7 pallet3 distributor0)
   deleted: (lifting hoist3 crate7) (clear pallet3)
   added: (available hoist3) (at crate7 distributor0) (clear crate7) (on crate7 pallet3)
   goals met: 10 of 12
125. (drop hoist4 crate0 pallet4 distributor1)
   deleted: (lifting hoist4 crate0) (clear pallet4)
   added: (available hoist4) (at crate0 distributor1) (clear crate0) (on crate0 pallet4)
   goals met: 11 of 12
126. (drop hoist2 crate10 crate8 depot2)
   deleted: (lifting hoist2 crate10) (clear crate8)
   added: (available hoist2) (at crate10 depot2) (clear crate10) (on crate10 crate8)
   goals met: 12 of 12
